<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>5.&nbsp;Syst&egrave;mes de fichiers</title><link rel="stylesheet" type="text/css" href="html.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="&Eacute;l&eacute;ments d'informatique"><link rel="up" href="exploitation.html" title="Chapitre&nbsp;5.&nbsp;Exploitation"><link rel="prev" href="systeme.html" title="4.&nbsp;Syst&egrave;mes d'exploitation"><link rel="next" href="index-termes.html" title="Index"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">5.&nbsp;Syst&egrave;mes de fichiers</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="systeme.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><th width="60%" align="center">Chapitre&nbsp;5.&nbsp;Exploitation</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="index-termes.html">Suivant</a></td></tr></table><hr></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="fichiers"></a>5.&nbsp;Syst&egrave;mes de fichiers</h2></div></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2015"></a>5.1.&nbsp;G&eacute;n&eacute;ralit&eacute;s</h3></div></div></div><p>Un <span class="emphasis"><em>disque</em></span><a class="indexterm" name="d0e2022"></a> est une unit&eacute; physique sur laquelle il est possible d'enregistrer des informations. Dans les syst&egrave;mes on emploie g&eacute;n&eacute;ralement cette terminologie m&ecirc;me quand il n'y a pas &agrave; proprement parler d'objet circulaire plat en jeu (ex.: clef USB).</p><p>Ces informations sont regroup&eacute;es dans des <span class="emphasis"><em>syst&egrave;mes de fichiers</em></span><a class="indexterm" name="d0e2030"></a> (en anglais FS, <span class="foreignphrase"><em class="foreignphrase">filesystems</em></span>). Ces syst&egrave;mes de fichiers peuvent occuper un disque entier (c'est le cas g&eacute;n&eacute;ral pour les p&eacute;riph&eacute;riques amovibles&nbsp;: disquettes, clef, CD/DVD...) ou bien &ecirc;tre contenus dans une ou plusieurs <span class="emphasis"><em>partitions</em></span><a class="indexterm" name="d0e2039"></a>, lesquelles sont simplement des segment du disque (c'est g&eacute;n&eacute;ralement le cas pour les disques dur). Les partitions sont parfois appel&eacute;es <span class="emphasis"><em>disques logiques</em></span><a class="indexterm" name="d0e2045"></a> et sont alors trait&eacute;es par le syst&egrave;me comme s'il s'agissait de disques diff&eacute;rents. Pr&eacute;parer un disque pour y mettre un syst&egrave;me de fichier, s'appelle <span class="emphasis"><em>formatage de bas niveau</em></span>. Mettre un syst&egrave;me de fichier sur une partition ou un disque est appel&eacute; <span class="emphasis"><em>formatage</em></span><a class="indexterm" name="d0e2054"></a> (ou <span class="emphasis"><em>formatage de haut niveau</em></span>). Cette double terminologie, tr&egrave;s largement en usage, ne se justifie plus vraiment aujourd'hui et est parfois source de confusions.</p><p>Les syst&egrave;mes de fichiers sont des ressources parmi d'autres. On peut imaginer un syst&egrave;me sans disque (OS des routeurs, p.ex.). &Agrave; l'inverse, un OS donn&eacute; peut g&eacute;rer de nombreux types de syst&egrave;mes de fichiers&nbsp;: tout d&eacute;pend des gestionnaires int&eacute;gr&eacute;s au noyau. Ainsi les WindowsNT r&eacute;cents lisent les disques Macintosh (HFS). De m&ecirc;me Linux lit tous les syst&egrave;mes courrants (dont Macintosh et Windows). Les syst&egrave;mes de fichiers Unix s'autod&eacute;fragmentent &agrave; l'utilisation. Les autres doivent &ecirc;tre r&eacute;guli&egrave;rement remis "&agrave; neuf" (d&eacute;fragmentation voire reformattage).</p><p>La structure d'un syst&egrave;me de fichiers est une <span class="emphasis"><em>arborescence</em></span><a class="indexterm" name="d0e2067"></a>&nbsp;: elle est constitu&eacute;e d'un dossier <span class="emphasis"><em>racine</em></span><a class="indexterm" name="d0e2073"></a> qui, lui-m&ecirc;me, contient des <span class="emphasis"><em>dossiers</em></span><a class="indexterm" name="d0e2079"></a> ou <span class="emphasis"><em>r&eacute;pertoires</em></span> qui eux-m&ecirc;me contiennent etc. C'est, finalement, un arbre dont les "noeuds" sont les dossiers et les "feuilles" les fichiers<a class="indexterm" name="d0e2086"></a> (et autres n&#339;uds sp&eacute;ciaux). Chaque dossier peut contenir des fichiers &eacute;ventuellement de plusieurs types diff&eacute;rents.</p><p>Pour que le syst&egrave;me de fichier d'une partition soit utilis&eacute; par le syst&egrave;me d'exploitation, il faut que cette partition soit <span class="emphasis"><em>mont&eacute;e</em></span><a class="indexterm" name="d0e2094"></a>. Cette op&eacute;ration est, le plus souvent automatique. En revanche, le d&eacute;montage doit g&eacute;n&eacute;ralement &ecirc;tre demand&eacute; manuellement pour les syst&egrave;mes amovibles (clef USB, disquette etc.). Comme une information n'est pas toujours transmise imm&eacute;diatement aux syst&egrave;mes de fichiers mont&eacute;s par le syst&egrave;me (c'est ce qu'on appelle un fonctionnement asynchrone), il est n&eacute;cessaire de toujours &eacute;teindre un ordinateur par la proc&eacute;dure pr&eacute;vue, de fa&ccedil;on que les syst&egrave;mes soient correctement "d&eacute;mont&eacute;s". Sinon, des erreurs peuvent appara&icirc;tre.</p><p>Note pour Unix&nbsp;: Sous Unix, tous les syst&egrave;mes de fichiers sont <span class="emphasis"><em>attach&eacute;s</em></span><a class="indexterm" name="d0e2102"></a> (ou mont&eacute;s) en remplacement d'un dossier particulier de l'arborescence d&eacute;j&agrave; mont&eacute;e ou directement &agrave; la racine. Attention&nbsp;: plusieurs chemins dans l'arbre peuvent d&eacute;signer exactement le m&ecirc;mes fichier (au m&ecirc;me emplacement) sur un disque. On dit que ces chemins sont des <span class="emphasis"><em>liens physiques</em></span><a class="indexterm" name="d0e2108"></a> vers le m&ecirc;me fichiers. Dans ce cas, l'arborescence n'est pas vraiment un arbre puisque deux "branches" convergent.</p><p>(&agrave; faire : sch&eacute;ma)</p><p>Note pour MacOS&nbsp;: Sous MacOS les syst&egrave;mes de fichiers apparaissent g&eacute;n&eacute;ralement sous la forme d'un dossier sur le bureau (le plus souvent avec un ic&ocirc;ne de disque, par d&eacute;faut).</p><p>Note pour Windows&nbsp;: Sous Windows les syst&egrave;mes de fichiers apparaissent sous la forme d'une lettre sur le poste de travail&nbsp;: <code class="literal">A:</code> pour le syst&egrave;me sur la disquette, <code class="literal">C:</code> pour le "disque" -&nbsp;en fait le syst&egrave;me de fichiers&nbsp;- principal, <code class="literal">D:</code> pour le suivant, etc.</p><p>Sous les environnement de travail usuels un fichier peut se contenter de pointer vers un autre fichier (ou dossier), on parle de <span class="emphasis"><em>raccourci</em></span><a class="indexterm" name="d0e2131"></a> (ou <span class="emphasis"><em>alias</em></span><a class="indexterm" name="d0e2137"></a> sur MacOS). Sous Unix, il existe une possibilit&eacute; suppl&eacute;mentaire : les <span class="emphasis"><em>liens symboliques</em></span><a class="indexterm" name="d0e2143"></a>. C'est une version renforc&eacute;e de l'alias&nbsp;: &eacute;diter un lien symbolique revient &agrave; &eacute;diter son fichier cible (sauf pr&eacute;caution particuli&egrave;re). Ceci peut &ecirc;tre particuli&egrave;rement utile aux serveurs <span class="foreignphrase"><em class="foreignphrase">web</em></span> et aux serveurs de fichiers (FTP),... &agrave; condition de prendre garde &agrave; ne pas confondre le lien avec sa cible.</p><p>Sur les serveurs en r&eacute;seau, les utilisateurs ou les groupes d'utilisateurs se voient g&eacute;n&eacute;ralement imposer un <span class="emphasis"><em>quota</em></span><a class="indexterm" name="d0e2154"></a> d'utilisation des disques. Un disque leur appara&icirc;t plein quand le quota (en volume et/ou en nombre de fichiers) est atteint.</p><p>Les gros syst&egrave;mes ou les ordinateurs qui demandent une forte s&eacute;curisation des donn&eacute;es peuvent mettre en place un syst&egrave;me de <span class="emphasis"><em>journalisation</em></span><a class="indexterm" name="d0e2162"></a> qui garde trace de toutes les op&eacute;rations et permet de r&eacute;cup&eacute;rer des fichiers "accident&eacute;s". Les ordinateurs serveurs sont, par ailleurs, souvent &eacute;quip&eacute;s de syst&egrave;mes de r&eacute;plication de disques (RAID<a class="indexterm" name="d0e2166"></a>) qui permet de conserver les donn&eacute;es m&ecirc;me quand l'un des disques durs tombe en panne.</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2170"></a>5.2.&nbsp;La m&eacute;moire virtuelle</h3></div></div></div><p>Quand une machine ne dispose plus d'assez de m&eacute;moire vive pour y placer tous les processus, elle peut utiliser une partie (d&eacute;limit&eacute;e) de l'espace disque appel&eacute;e <span class="emphasis"><em>m&eacute;moire d'&eacute;change</em></span> (en anglais <span class="foreignphrase"><em class="foreignphrase">swap</em></span><a class="indexterm" name="d0e2180"></a>). La combinaison de la m&eacute;moire vive et de la m&eacute;moire d'&eacute;change pour y placer les processus, de fa&ccedil;on transparente pour eux, est appel&eacute;e <span class="emphasis"><em>m&eacute;moire virtuelle</em></span><a class="indexterm" name="d0e2187"></a>. Attention&nbsp;: comme l'acc&egrave;s aux donn&eacute;es sur un disque est consid&eacute;rablement plus long qu'en m&eacute;moire vive, cela peut ralentir beaucoup une machine. Ce ralentissement est particuli&egrave;rement sensible quand plusieurs processus trop "volumineux" sont utilis&eacute;s simultan&eacute;ment (et non cons&eacute;cutivement)&nbsp;: la machine passe alors son temps &agrave; transf&eacute;rer les processus depuis la m&eacute;moire d'&eacute;change vers la m&eacute;moire vive et inversement. Il faut donc veiller &agrave; dimensionner correctement la m&eacute;moire vive, la m&eacute;moire d'&eacute;change ne devant &ecirc;tre qu'une roue de secours.</p><p>Ceci est d'autant plus important pour les serveurs <span class="foreignphrase"><em class="foreignphrase">web</em></span> (ou de fichiers) tournant sous Unix. En effet, les syst&egrave;mes Unix conservent un fichier lu r&eacute;cemment en m&eacute;moire vive (tant qu'il y en a de libre). Un serveur <span class="foreignphrase"><em class="foreignphrase">web</em></span> a donc int&eacute;r&ecirc;t &agrave; avoir beaucoup de m&eacute;moire&nbsp;: dans ce cas les fichiers sont lus &agrave; partir de leur copie (cache) en m&eacute;moire vive et non &agrave; partir du disque. Cela limite les acc&egrave;s au disque et peut augmenter consid&eacute;rablement sa vitesse de traitement, m&ecirc;me pour de gros sites.</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d0e2199"></a>5.3.&nbsp;Privil&egrave;ges sous Unix</h3></div></div></div><p>Sous Unix, cas le plus fr&eacute;quent de serveurs web et FTP, les privil&egrave;ges d'acc&egrave;s &agrave; chaque fichier et &agrave; chaque dossier se r&eacute;partissent en trois cat&eacute;gories&nbsp;:</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>U - Les privil&egrave;ges pour le compte utilisateur propri&eacute;taire du fichier. G&eacute;n&eacute;ralement, le propri&eacute;taire d'un fichier est celui qui l'a cr&eacute;&eacute;.</p></li><li class="listitem"><p>G - Ceux pour un groupe d'utilisateurs bien d&eacute;fini appel&eacute; &laquo;&nbsp;groupe propri&eacute;taire&nbsp;&raquo;. Le groupe "propri&eacute;taire" est l'un des groupes d'utilisateur choisi par le propri&eacute;taire.</p></li><li class="listitem"><p>O - Ceux pour le reste des utilisateurs (o&nbsp;: <span class="foreignphrase"><em class="foreignphrase">other</em></span>).</p></li></ul></div><p>Pour chacune de ces cat&eacute;gories, sont d&eacute;finit trois bascules&nbsp;:</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>R - Autorisation de lire le fichier ou de lister le dossier.</p></li><li class="listitem"><p>W - Autorisation de modifier le fichier ou le dossier.</p></li><li class="listitem"><p>X - Pour un fichier&nbsp;: autorisation d'ex&eacute;cuter (c'est un logiciel). Pour un dossier&nbsp;: autorisation d'acc&eacute;der au contenu.</p></li></ul></div><p>Le propri&eacute;taire d'un fichier ou dossier, ou l'administrateur, peuvent donc r&eacute;gler neuf autorisations ind&eacute;pendantes.</p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="systeme.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="exploitation.html">Niveau sup&eacute;rieur</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="index-termes.html">Suivant</a></td></tr><tr><td width="40%" align="left" valign="top">4.&nbsp;Syst&egrave;mes d'exploitation&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td><td width="40%" align="right" valign="top">&nbsp;Index</td></tr></table></div></body></html>