<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>4.&nbsp;Images fixes</title><link rel="stylesheet" type="text/css" href="html.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="&Eacute;l&eacute;ments d'informatique"><link rel="up" href="types-fichiers.html" title="Chapitre&nbsp;3.&nbsp;Types usuels de fichiers"><link rel="prev" href="textes.html" title="3.&nbsp;Documents textuels"><link rel="next" href="ordinateur.html" title="Chapitre&nbsp;4.&nbsp;Structure d'un ordinateur"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">4.&nbsp;Images fixes</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="textes.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><th width="60%" align="center">Chapitre&nbsp;3.&nbsp;Types usuels de fichiers</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ordinateur.html">Suivant</a></td></tr></table><hr></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="images"></a>4.&nbsp;Images fixes</h2></div></div></div><p>Comme pour les documents textuels, il faut distinguer, pour les images, les formats destin&eacute;s au travail, &agrave; l'archivage et &agrave; la communication. Pour l'archivage, la r&egrave;gle est, le plus souvent d'utiliser les formats les plus proches de l'outil de cr&eacute;ation ou de num&eacute;risation. Pour les format de travail, il est recommand&eacute; de conserver le document dans le format sp&eacute;cifique au logiciel utilis&eacute;&nbsp;: PSD pour <em class="citetitle">Photoshop</em>, AI (EPS) pour <em class="citetitle">Illustrator</em>, FLA pour <em class="citetitle">Flash</em>, XCF pour <em class="citetitle">GIMP</em> etc. Ces formats, pour les logiciels les plus &eacute;volu&eacute;s du moins, incluent toutes les possibilit&eacute;s offertes par ces logiciels et permettent souvent de m&ecirc;ler sous forme de calques ou de canaux des bitmaps, des objets vectoriels, des chemins etc. Ce travail, &agrave; conserver autant que possible, peut ensuite &ecirc;tre &#8220;export&eacute;&#8221;, c'est &agrave; dire traduit, r&eacute;encod&eacute;, dans un format autre, destin&eacute; &agrave; la publication vis&eacute;e.</p><p>Nous pr&eacute;senterons ici les principaux formats d'images, leurs avantages et leurs inconv&eacute;nients. Le d&eacute;tail de ces formats et de leurs possibilit&eacute;s seront &eacute;tudi&eacute;s plus en d&eacute;tail au second semestre.</p><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="bitmap-truecolor"></a>4.1.&nbsp;Bitmaps &#8220;sans&#8221; perte en &#8220;vraies&#8221; couleurs</h3></div></div></div><p>Le type le plus usuel d'images num&eacute;riques fixes est celui du <span class="emphasis"><em>bitmap</em></span><a class="indexterm" name="d0e1193"></a> ou <span class="emphasis"><em>image en mode point</em></span><a class="indexterm" name="d0e1199"></a>. Ces images sont constitu&eacute;es d'une grille ou matrice de rectangles de m&ecirc;mes dimensions appel&eacute;s <span class="emphasis"><em>pixels</em></span><a class="indexterm" name="d0e1205"></a>. Les principaux formats en mode point sont PNG (prononcer &laquo;&nbsp;ping&nbsp;&raquo;), JPEG et GIF, mais il en existe de tr&egrave;s nombreux autres.</p><div class="figure"><a name="d0e1209"></a><p class="title"><b>Figure&nbsp;3.1.&nbsp;Agrandissements d'une image en mode point</b></p><div class="figure-contents"><div class="mediaobject"><img src="resources/graphbitmap.png" alt="Agrandissements d'une image en mode point"></div></div></div><br class="figure-break"><p>Les formats de bitmap diff&egrave;rent tout d'abord dans leurs possibilit&eacute; de rendu par le mod&egrave;le de couleurs (et donc le nombre de couleurs) qu'ils autorisent. Le mod&egrave;le de repr&eacute;sentation le plus usuel des couleurs est appel&eacute;, improprement &laquo;&nbsp;vraies couleurs&nbsp;&raquo;. Il code ces couleurs, par synth&egrave;se additive (comme sur un &eacute;cran lumineux), &agrave; l'aide d'une combinaison de rouge, vert et bleu, &agrave; raison de 8 ou 16 bits (1 ou 2 octets) par composante et par pixel, soit 16&nbsp;M teintes (ou 2,8.10<sup>14</sup> teintes, pour les archives et traitements professionnels).</p><div class="figure"><a name="d0e1222"></a><p class="title"><b>Figure&nbsp;3.2.&nbsp;Synth&egrave;se additive</b></p><div class="figure-contents"><div class="mediaobject"><img src="resources/synthese+.png" width="135" alt="Synth&egrave;se additive"></div></div></div><br class="figure-break"><p>On appelle g&eacute;n&eacute;ralement <span class="emphasis"><em>profondeur des couleurs</em></span><a class="indexterm" name="d0e1232"></a> le nombre de bits r&eacute;serv&eacute;s pour chaque pixels. Si l'on utilise 8&nbsp;bit par composante, la profondeur des couleurs est donc de 24&nbsp;bpp (bits par pixel). Dans ce cas chaque composante est repr&eacute;sent&eacute;e par un nombre de 0 &agrave; 255, soit deux chiffres hexad&eacute;cimaux&nbsp;:</p><div class="informaltable"><table border="1"><colgroup><col width="113" align="center"><col width="37"><col width="37"><col width="37"><col width="37"><col width="37"><col width="37"></colgroup><tbody><tr><td align="center">hexad&eacute;cimal</td><td>00</td><td>33</td><td>66</td><td>99</td><td>CC</td><td>FF</td></tr><tr><td align="center">d&eacute;cimal</td><td>0</td><td>51</td><td>102</td><td>153</td><td>204</td><td>255</td></tr><tr><td align="center">proportion</td><td>0&nbsp;%</td><td>20&nbsp;%</td><td>40&nbsp;%</td><td>60&nbsp;%</td><td>80&nbsp;%</td><td>100&nbsp;%</td></tr></tbody></table></div><p>On utilise maintenant souvent la notation suivante, issue du <span class="foreignphrase"><em class="foreignphrase">web</em></span>&nbsp;: #3399CC, qui signifie&nbsp;: rouge &agrave; 20&nbsp;%, vert &agrave; 60&nbsp;% et bleu &agrave; 80&nbsp;%.</p><p>Notons que le format PNG pr&eacute;voit &eacute;galement la possibilit&eacute; d'une quatri&egrave;me composante, d'opacit&eacute;&nbsp;: RGBA (rouge vert bleu alpha), soit 32&nbsp;bpp. Ceci est utilis&eacute; par les syst&egrave;mes d'exploitation pour les icones et pointeurs et maintenant tr&egrave;s r&eacute;pandu sur le <span class="foreignphrase"><em class="foreignphrase">web</em></span>, m&ecirc;me s'il n'est pas toujours bien pris en compte par certaines version du navigateur <em class="citetitle">Internet Explorer</em>.</p><p>Il existe d'autres modes de repr&eacute;sentation des couleurs, par exemple TSL (teinte, saturation, luminosit&eacute;) pour la vid&eacute;o ou CMJN (cyan, magenta, jaune, noir) pour l'imprimerie, puisque les encres fonctionnent par synth&egrave;se soustractive (le format TIFF, qui autorise ce mod&egrave;le, est dominant dans l'imprimerie).</p><div class="figure"><a name="d0e1306"></a><p class="title"><b>Figure&nbsp;3.3.&nbsp;Synth&egrave;se soustractive</b></p><div class="figure-contents"><div class="mediaobject"><img src="resources/synthese-.png" width="135" alt="Synth&egrave;se soustractive"></div></div></div><br class="figure-break"><p>Une possibilit&eacute; de codage des bitmaps consiste &agrave; donner la liste des teintes pour les diff&eacute;rents pixels, les uns &agrave; la suite des autres. C'est le format brut, il est extr&ecirc;mement consommateur de ressources. Les formats r&eacute;cent utilisent, <span class="foreignphrase"><em class="foreignphrase">a contrario</em></span>, des algorithmes de compression de donn&eacute;es pour r&eacute;duire la taille des images (par diff&eacute;rentes m&eacute;thode rep&eacute;rage de redondances). Ainsi une image de 2560&times;1712 pixels en 24&nbsp;bit/px, qui p&egrave;se 12,5&nbsp;Mio en format brut, ne p&egrave;sera en PNG que de 16kio (uni) &agrave; 6&nbsp;Mio (photo) &agrave; 12,5&nbsp;Mio (al&eacute;atoire). Ce type de format est appel&eacute; &#8220;sans&#8221; perte&nbsp;: il y a bien des pertes au moment de la num&eacute;risation mais pas du fait du codage du bitmap sous forme de fichier. Un m&ecirc;me fichier a donc la m&ecirc;me interpr&eacute;tation partout&nbsp;: l'image est conforme avec ses visualisations dans les logiciels de dessin.</p><p>Ces formats sont parfait pour le texte et les petites images.</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="bitmap-index"></a>4.2.&nbsp;Bitmaps &#8220;sans&#8221; perte en couleurs index&eacute;es</h3></div></div></div><p>Quand une image comporte tr&egrave;s peu de couleurs (256 ou moins), par exemple un dessin avec de grandes surfaces monochromes, les formats en vraies couleurs sont trop gourmand en quantit&eacute; d'information. Il est, dans ce cas, plus efficace d'utiliser une &laquo;&nbsp;palette&nbsp;&raquo;, un index des teintes d'une image, de fa&ccedil;on &agrave; coder chaque pixel sur 8 bits (au lieu de 24 ou 32). Premier b&eacute;n&eacute;fice, imm&eacute;diat&nbsp;: une r&eacute;duction de la taille par 3 (ou 4) au moins.</p><p>En pratique, les formats qui utilisent des couleurs index&eacute;es emploient des algorithmes qui tirent parti de similarit&eacute;s entre parties de l'image, similarit&eacute; dont la probabilit&eacute; augmente quand le nombre de couleurs diminues, particuli&egrave;rement en cas d'aplats de couleur unis. Le coefficient de r&eacute;duction d&eacute;passe donc souvent le facteur 3. Cas hypoth&eacute;tique extr&ecirc;me&nbsp;: une image de 2560&times;1712 pixels enti&egrave;rement monochrome ne p&egrave;se que 640&nbsp;o. Avec le drapeau japonais (aplat tr&egrave;s simple), on n'atteint que 23&nbsp;kio, soit 500 fois moins que le format brut.</p><p>Le format sans perte en couleurs index&eacute;es le plus populaire, bien qu'obsol&egrave;te, est le format GIF. GIF permet de disposer d'une &#8220;couleur&#8221; enti&egrave;rement transparente. Le format g&eacute;n&eacute;ralement le plus adapt&eacute;, aujourd'hui, est le format PNG (qui permet donc de coder une image soit en vraies couleurs, soit en couleurs index&eacute;es). En format PNG on dispose jusqu'&agrave; 256 niveaux de transparence, pour chaque teinte possible.</p><p>Cas particulier de palette&nbsp;: la palette &#8220;web&#8221;. Elle est principalement compos&eacute;e de couleurs dont les composantes RGB sont des multiples de 20%. En hexad&eacute;cimal, les couleurs s'&eacute;crivent donc comme une suite de l'un des six nombres suivants&nbsp;: 00, 33, 66, 99, CC, FF (en d&eacute;cimal&nbsp;: 0, 51, 102, 153, 204, 255). &Agrave; ces 6&times;6&times;6=216 couleurs s'ajoutent le transparent et huit couleurs de base, en tout 225 teintes (voir le cours <em class="citetitle">Documents structur&eacute;s pour le web</em> pour plus de d&eacute;tails).</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="jpeg"></a>4.3.&nbsp;Bitmaps avec pertes</h3></div></div></div><p>Les formats sans perte sont g&eacute;n&eacute;ralement peu adapt&eacute;s aux photographies. Tout d'abord parce que l'on n'a le plus souvent pas besoin d'une telle exactitudes, des pertes raisonnables sont admissibles. Ensuite parce que les algorithmes de compression de PNG et GIF ne sont pas tr&egrave;s efficaces sur les images photographiques. JPEG est un format d'image permettant de compresser plus de telles images. La perte de qualit&eacute; utilis&eacute;e par JPEG tire partie d'une redondance psychovisuelle.</p><p><span class="emphasis"><em>Redondances de code</em></span>&nbsp;: Il y a redondance dans le code d&#8217;une image si l'on peut utiliser moins de symbole pour la coder que strictement n&eacute;cessaire. Les formats d'images peuvent utiliser des algorithmes g&eacute;n&eacute;riques (pas adapt&eacute; &agrave; un type de document en particulier), comme l'algorithme LZW utilis&eacute; par GIF et TIFF, pour compresser des images.</p><p><span class="emphasis"><em>Redondances inter-pixels</em></span>&nbsp;: Les images r&eacute;ellement utilis&eacute;es ne sont pas des arrangements al&eacute;atoires de teintes. On peut rep&eacute;rer des corr&eacute;lations statistiques entre pixels proches, par exemple entre une ligne et la suivante. Ce type d'analyse permet de d&eacute;finir des algorithmes de compression sp&eacute;cifiques aux images, tels que pour PNG. Par exemple, on n'est pas oblig&eacute; de coder une ligne enti&egrave;re mais seulement des diff&eacute;rences avec la pr&eacute;c&eacute;dente.</p><p><span class="emphasis"><em>Redondances psychovisuelles</em></span>&nbsp;: Quand nous observons une image, surtout de r&eacute;solution fine, nous ne regardons pas tous les pixels. Seuls certains &eacute;l&eacute;ments cl&eacute;s sont analys&eacute;s, par exemple des changements de couleurs, de contraste ou des variations &agrave; grande &eacute;chelle. Les autres informations sont dites psychovisuellement redondantes (cette notion est relative puisqu'un m&ecirc;me observateur peut oserver une image avec plus ou moins de d&eacute;tail). &Eacute;liminer ces informations permet d'all&eacute;ger le fichiers, au prix d'une perte de qualit&eacute; de l'image. Les donn&eacute;es perdues le sont, le plus souvent, de fa&ccedil;on irr&eacute;versible, contrairement &agrave; ce qui se produit dans de nombreux films policiers...</p><p>Toutefois, supposer cette redondance n'est pas toujours &agrave; propos&nbsp;:</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>La compression JPEG maltraite les bords francs.</p></li><li class="listitem"><p>JPEG n'est pas le format le plus compact pour les images constitu&eacute;es d'aplats de couleur.</p></li><li class="listitem"><p>JPEG est bien adapt&eacute; &agrave; la photographie num&eacute;rique (on peut souvent se contenter d'un bas niveau de qualit&eacute; JPEG).</p></li><li class="listitem"><p>JPEG est rarement le meilleur choix pour les images de petite taille (on est alors oblig&eacute; de choisir un haut niveau de qualit&eacute; JPEG).</p></li></ul></div><p>JPEG permet &eacute;galement d'inclure des donn&eacute;es sur la prise de vue (marque de l'appareil, optique, r&eacute;glages utilis&eacute;s, orientation, etc.).</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="bitmaps"></a>4.4.&nbsp;R&eacute;sum&eacute; synoptique sur les bitmaps</h3></div></div></div><p>Le choix entre PNG, GIF et JPEG peut se synth&eacute;tiser avec la grille suivante&nbsp;:</p><div class="informaltable"><table border="1"><colgroup><col width="33%"><col width="33%"><col width="34%"></colgroup><tbody><tr><td>Compression &#8220;sans perte&#8221;, avec palette</td><td>Compression sans perte, &#8220;vraies&#8221; couleurs</td><td>Codage avec pertes</td></tr><tr><td>PNG en mode palette (ou GIF)</td><td>PNG &#8220;vraies&#8221; couleurs (<span class="foreignphrase"><em class="foreignphrase">truecolors</em></span>)</td><td>JPEG</td></tr><tr><td>La perte se fait en choisissant une palette de 256 couleurs (au plus). Plus la palette est r&eacute;duite, moins le fichier sera volumineux.</td><td>Pas de perte li&eacute;e au codage.</td><td>On choisit le niveau de perte (donc la qualit&eacute; de l'image r&eacute;sultante) de fa&ccedil;on &agrave; ajuster la taille de fichier.</td></tr><tr><td>indiqu&eacute; quand il y a peu de couleurs (&lt;256)</td><td>16&nbsp;M couleurs (RVB)</td><td>16&nbsp;M couleurs (RBV)</td></tr><tr><td>Parmi les couleurs il y a la transparence (&agrave; pr&eacute;f&eacute;rer pour les logotypes). En PNG, on peut m&ecirc;me avoir 256 niveaux d'opacit&eacute; (l'alpha).</td><td>256 niveaux d'opacit&eacute; (alpha) - utile pour repr&eacute;senter des ombres ou des superpositions</td><td>pas de transparence possible</td></tr><tr><td>GIF&nbsp;: possibilit&eacute;s de petites animation (pas pour PNG) - peu professionnel (utiliser plut&ocirc;t Flash)</td><td>image fixe</td><td>image fixe</td></tr><tr><td>indiqu&eacute; pour les petites images (miniatures, logos, etc.) ou quand il y a peu de couleurs (&lt;256)</td><td>indiqu&eacute; pour les images de taille moyenne demandant plus de 256 couleurs</td><td>indiqu&eacute; pour des photographies (sauf en cas de petite taille)</td></tr><tr><td>traite bien les bords francs et les aplats de couleur (ex.: texte, dessins en ligne claire)</td><td>traite bien les bords francs et les aplats de couleur (ex.: texte, dessins en ligne claire)</td><td>maltraite les bords francs et n'est pas efficace sur les aplats de couleur</td></tr></tbody></table></div><p>Voici les principaux noms des dimensions (en pixels) des formats vid&eacute;o usuels (ci-apr&egrave;s). On sera vigilant les notions de rapports &#8220;4/3&#8221;, &#8220;16/9&#8221; ou &#8220;16/10&#8221;, dans la mesure o&ugrave; dans le rendu de ces formats, les pixels ne sont pas n&eacute;cessairement carr&eacute;s (en particulier dans le cas des formats t&eacute;l&eacute;visuels h&eacute;rit&eacute;s d'avant l'&egrave;re num&eacute;rique).</p><div class="informaltable"><table border="1"><colgroup><col width="33%"><col width="33%"><col width="34%"></colgroup><thead><tr><th align="center">Dimensions (px)</th><th align="center">Nb. pixels</th><th align="center">Nom, utilisation</th></tr></thead><tbody><tr><td>320 &times; 240</td><td>64 k</td><td>QVGA (quart de VGA), t&eacute;l&eacute;phones, webcams</td></tr><tr><td>640 &times; 480</td><td>300 k</td><td>VGA (video graphics array), anciens moniteurs de 14" ou moins, t&eacute;l&eacute;phones, PDA</td></tr><tr><td>720 &times; 480</td><td>340 k</td><td>NTSC (SDTV480i ou EDTV480p)</td></tr><tr><td>720 &times; 576</td><td>400 k</td><td>PAL/SECAM (SDTV)</td></tr><tr><td>800 &times; 600</td><td>0,5 M</td><td>traditionnellement conseill&eacute; pour un moniteur de 14" &agrave; 15" (bas de gamme), un des formats SVGA</td></tr><tr><td>1024 &times; 768</td><td>0,8 M</td><td>XGA (extended graphics array), traditionnellementconseill&eacute; pour un moniteur de 17" (moyenne gamme), un des formats SVGA</td></tr><tr><td>1280 &times; 720</td><td>0,9 M</td><td>HD TV 720 (ou WXGA-H)</td></tr><tr><td>1366 &times; 768</td><td>1,0 M</td><td>WXGA (wide XGA), moniteur 17" 16/9</td></tr><tr><td>1440 &times; 900</td><td>1,3 M</td><td>format fr&eacute;quent pour les portables 17" dits 16/9</td></tr><tr><td>1280 &times; 1024</td><td>1,3 M</td><td>SXGA (super XGA), traditionnellement conseill&eacute; pour un moniteur 19" (haut de gamme), un des formats SVGA</td></tr><tr><td>1600 &times; 1024</td><td>1,6 M</td><td>WSXGA (wide SXGA), moniteurs 19" dits 16/9</td></tr><tr><td>1680 &times; 1050</td><td>1,8 M</td><td>WSXGA+, moniteur 19" dits 16/9</td></tr><tr><td>1600 &times; 1200</td><td>1,9 M</td><td>UXGA (ultra XGA), conseill&eacute; pour un moniteur 21" 4/3 (haut de gamme), un des formats SVGA</td></tr><tr><td>1920 &times; 1080</td><td>2,0 M</td><td>HDTV 1080</td></tr><tr><td>1920 &times; 1200</td><td>2,3 M</td><td>WUXGA (wide UXGA), moniteur 21" dit 16/9</td></tr></tbody></table></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="vectoriel"></a>4.5.&nbsp;Dessins vectoriels</h3></div></div></div><p>L'image n'est pas constitu&eacute;e d'une grille de pixels mais est de nature symbolique. Il s'agit d'une succession d'objets graphiques&nbsp;: aplats de couleur (uni, d&eacute;grad&eacute;, texture...), lignes, texte. Ces objets sont d&eacute;finis par des fonctions g&eacute;om&eacute;triques, des coordonn&eacute;es, des teintes et autres param&egrave;tres d'aspect. Ils sont vectoriels&nbsp;: ils peuvent &ecirc;tre multipli&eacute;s par un nombre servant de facteur d'&eacute;chelle (un scalaire) sans perte de qualit&eacute;. Parfois les dessins vectoriels incorporent &eacute;galement des bitmaps... ils ne sont donc plus a proprement parler vectoriels, m&ecirc;me si le format de fichier reste vectoriel.</p><div class="figure"><a name="d0e1557"></a><p class="title"><b>Figure&nbsp;3.4.&nbsp;Agrandissements<a href="#ftn.d0e1560" class="footnote" name="d0e1560"><sup class="footnote">[4]</sup></a> d'une image vectorielle</b></p><div class="figure-contents"><div class="mediaobject"><table border="0" summary="manufactured viewport for HTML img" style="cellpadding: 0; cellspacing: 0;" width="780"><tr><td><img src="resources/graphvect.png" width="780" alt="Agrandissements[4] d'une image vectorielle"></td></tr></table></div></div></div><br class="figure-break"><p>Principaux formats&nbsp;:</p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>SVG&nbsp;: pour le web, principalement (interactivit&eacute; possible)</p></li><li class="listitem"><p>Flash&nbsp;: dessins anim&eacute;s et publicit&eacute; web, permet d'ajouter de l'interactivit&eacute; par programme</p></li><li class="listitem"><p>EPS (ou AI)&nbsp;: format natif d'Adobe Illustrator, le standard professionnel</p></li><li class="listitem"><p>WMF (ou EMF)&nbsp;: m&eacute;tafichier windows, utilis&eacute; principalement pour des &#8220;cliparts&#8221; destin&eacute;s aux traitement de texte</p></li></ul></div></div><div class="footnotes"><br><hr style="width:100; text-align:left;margin-left: 0"><div id="ftn.d0e1560" class="footnote"><p><a href="#d0e1560" class="para"><sup class="para">[4] </sup></a>Attention&nbsp;: cet exemple est r&eacute;alis&eacute; &agrave; l'aide d'une image en mode point. Son affichage ni son impression ne peuvent donc rendre correctement l'effet d'un agrandissement vectoriel, seulement le sugg&eacute;rer.</p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="textes.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="types-fichiers.html">Niveau sup&eacute;rieur</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ordinateur.html">Suivant</a></td></tr><tr><td width="40%" align="left" valign="top">3.&nbsp;Documents textuels&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td><td width="40%" align="right" valign="top">&nbsp;Chapitre&nbsp;4.&nbsp;Structure d'un ordinateur</td></tr></table></div></body></html>