<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>6.&nbsp;Cas des signaux multidimensionnels</title><link rel="stylesheet" type="text/css" href="html.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="&Eacute;l&eacute;ments d'informatique"><link rel="up" href="codage.html" title="Chapitre&nbsp;2.&nbsp;Le codage de l'information"><link rel="prev" href="code-2d.html" title="5.&nbsp;&Eacute;chantillonnage multidimensionnel"><link rel="next" href="types-fichiers.html" title="Chapitre&nbsp;3.&nbsp;Types usuels de fichiers"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">6.&nbsp;Cas des signaux multidimensionnels</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="code-2d.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><th width="60%" align="center">Chapitre&nbsp;2.&nbsp;Le codage de l'information</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="types-fichiers.html">Suivant</a></td></tr></table><hr></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="multidim"></a>6.&nbsp;Cas des signaux multidimensionnels</h2></div></div></div><p><a name="signal-3d"></a>Le signal, lui aussi, peut avoir plusieurs dimensions. Par exemple un son peut &ecirc;tre monophonique ou st&eacute;r&eacute;ophonique. Une image n'est g&eacute;n&eacute;ralement pas en noir-et-blanc (demi-teinte) mais peut prendre toutes les teintes perceptibles. Dans ce cas, pour la num&eacute;risation, on divise le signal multidimensionnel en <span class="emphasis"><em>composantes</em></span> 1D. Pour un son st&eacute;r&eacute;o, il s'agira des canaux "gauche" et "droite", par exemple. Pour une image en couleur, il s'agira des composantes "rouge", "vert", "bleu", par exemple. Les diff&eacute;rentes composantes subissent ensuite la m&ecirc;me quantification. Sur chaque &eacute;chantillon, on a donc autant de valeurs num&eacute;riques que de composantes.</p><p>Les images couleurs habituelles sont quantifi&eacute;es &agrave; raison d'un octet par composante (256 niveaux), 24&nbsp;bit en tout, soit 16&nbsp;M teintes possibles pour chaque pixel. Les professionnels et certains scanner utilisent une quantification deux fois plus fine&nbsp;: 16&nbsp;bit par composante (48 en tout), soit 64&nbsp;k niveaux par composante.</p><p>La formule g&eacute;n&eacute;rale pour la quantit&eacute; brute d'information est&nbsp;: p&nbsp;=&nbsp;c.q.r&nbsp;=&nbsp;c&nbsp;&times;&nbsp;q&nbsp;&times;&nbsp;t<sup>d</sup>, o&ugrave; c est le nombre de composantes, q la quantit&eacute; d'information n&eacute;cessaire pour quantifier chaque &eacute;chantillon, r la r&eacute;solution, t la "taille", d le nombre de dimensions.</p><p>Ce que nous venons de d&eacute;crire constitue le codage brut. Il est parfois tr&egrave;s volumineux si la r&eacute;solution est &eacute;lev&eacute;e. Souvent ce codage brut est suivi d'une compression, &eacute;ventuellement avec perte, pour r&eacute;duire la masse des donn&eacute;es et &eacute;ventuellement parer &agrave; des probl&egrave;mes de transmission.</p><p>Exemple 1&nbsp;: Une image couleur "4M pixels" au format "24&times;36" (c'est &agrave; dire un rapport 3/2) donnera une r&eacute;solution de 2560&times;1712 pixels. Si l'on &eacute;chantillonne &agrave; raison d'un octet par composante (rouge, vert, bleu) et par pixel, l'image brute (avant compression) p&egrave;sera 12,5&nbsp;Mio, soit l'&eacute;quivalent de 8&nbsp;000 pages de texte, environ 40&nbsp;romans. Avec le niveau de compression JPEG habituel des appareils photos, l'image enregistr&eacute;e (avec pertes) ne p&egrave;sera plus qu'environ 1&nbsp;Mio (dix fois moins).</p><p>Exemple 2&nbsp;: Pour du son en qualit&eacute; CD (44,1&nbsp;kHz, 16 bit, st&eacute;r&eacute;o), on a donc, chaque seconde 2&times;44&nbsp;100 &eacute;chantillons de 2 octets chacun, soit environ 176&nbsp;ko/s. L'image de l'exemple 1 correspond donc &agrave; une minute de son environ (dans cette qualit&eacute;). Avec un codage MP3 usuel, on comptera g&eacute;n&eacute;ralement une consommation 5 &agrave; 11 fois moindre&nbsp;: 16 &agrave; 32&nbsp;ko/s, soit 128 &agrave; 256&nbsp;kbit/s (on compte plus souvent en bits par seconde) pour un signal st&eacute;r&eacute;ophonique.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="code-2d.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="codage.html">Niveau sup&eacute;rieur</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="types-fichiers.html">Suivant</a></td></tr><tr><td width="40%" align="left" valign="top">5.&nbsp;&Eacute;chantillonnage multidimensionnel&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td><td width="40%" align="right" valign="top">&nbsp;Chapitre&nbsp;3.&nbsp;Types usuels de fichiers</td></tr></table></div></body></html>