<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>2.&nbsp;Programmes et processus</title><link rel="stylesheet" type="text/css" href="html.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="&Eacute;l&eacute;ments d'informatique"><link rel="up" href="exploitation.html" title="Chapitre&nbsp;5.&nbsp;Exploitation"><link rel="prev" href="exploitation.html" title="Chapitre&nbsp;5.&nbsp;Exploitation"><link rel="next" href="utilisateur.html" title="3.&nbsp;Gestion des utilisateurs"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">2.&nbsp;Programmes et processus</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="exploitation.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><th width="60%" align="center">Chapitre&nbsp;5.&nbsp;Exploitation</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="utilisateur.html">Suivant</a></td></tr></table><hr></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="programme"></a>2.&nbsp;Programmes et processus</h2></div></div></div><p>L'&ecirc;tre humain qui doit utiliser une application n'interagit que d'une fa&ccedil;on virtuelle avec celle-ci&nbsp;: en r&eacute;alit&eacute; il interagit mat&eacute;riellement avec la machine. Il faut donc une interface entre les deux&nbsp;: elle est r&eacute;alis&eacute;e par le syst&egrave;me d'exploitation, aussi appel&eacute; syst&egrave;me (tout court), qui abstrait la machine.</p><p>Le syst&egrave;me donne des moyens logiciels permettant aux diverses applications d'utiliser chaque &eacute;l&eacute;ment mat&eacute;riel. Par exemple pour un disque dur, le syst&egrave;me contient un gestionnaire de disque dur, qui permet aux applications d'enregistrer des donn&eacute;es sans s'inqui&eacute;ter des diff&eacute;rents mod&egrave;les de disques. Les &eacute;l&eacute;ments du syst&egrave;mes qui donnent acc&egrave;s aux p&eacute;riph&eacute;riques sont appel&eacute;s <span class="emphasis"><em>pilotes</em></span> ou <span class="emphasis"><em>gestionnaires</em></span>, en anglais <span class="foreignphrase"><em class="foreignphrase">drivers</em></span>.</p><p>La contrepartie en m&eacute;moire d'un logiciel en train de s'ex&eacute;cuter est appel&eacute;e <span class="emphasis"><em>processus</em></span><a class="indexterm" name="d0e1803"></a>. Le syst&egrave;me a notamment pour r&ocirc;le de g&eacute;rer la m&eacute;moire et le temps de calcul, notamment pour le r&eacute;partir entre les divers processus (c'est &agrave; dire entre les t&acirc;ches &agrave; effectuer &agrave; un moment donn&eacute;). Quand un seul processus est r&eacute;ellement actif &agrave; un moment donn&eacute; ou que les processus se passent la main (ex. : windows 95) et, donc, sont susceptibles de bloquer la machine, on dit que le syst&egrave;me est <span class="emphasis"><em>monot&acirc;che</em></span><a class="indexterm" name="d0e1809"></a>. Quand c'est le syst&egrave;me qui d&eacute;coupe arbitrairement son temps et le r&eacute;partit entre les processus, on dit qu'il est <span class="emphasis"><em>multit&acirc;che</em></span><a class="indexterm" name="d0e1815"></a>.</p><p>Les principaux types de syst&egrave;mes actuels sont&nbsp;: UNIX (dont Linux), WindowsNT (dont Windows XP), MacOS, DOS (associ&eacute; &agrave; Windows non-NT). Les syst&egrave;mes "r&eacute;cents" (Unix, WindowsNT, MacOS depuis la version 9) sont r&eacute;ellement multit&acirc;ches et sont d'architecture g&eacute;n&eacute;rale relativement proche.</p><p>Les services permanents (serveur web, serveur de fichiers, etc.) sont assur&eacute;s par des processus "dormants" qui se "r&eacute;veillent" quand une requ&egrave;te arrive. On parle parfois de <span class="emphasis"><em>d&eacute;mons</em></span>. Sous WindowsNT les services automatiquements lanc&eacute;s sont contr&ocirc;l&eacute;s par un <span class="emphasis"><em>gestionnaire de services</em></span>. Sous Unix (dont Linux), les outils de configuration propre &agrave; chaque distribution permettent de d&eacute;cider quels services doivent &ecirc;tre ou non activ&eacute;s.</p><p>Les syst&egrave;mes &eacute;volu&eacute;s disposent d'un (ou plusieurs) <span class="emphasis"><em>gestionnaires de t&acirc;ches</em></span><a class="indexterm" name="d0e1833"></a>, qui permettent de g&eacute;rer certains privil&egrave;ges ou de "tuer" des processus (parce qu'ils ne r&eacute;pondent plus, par exemple). Sous les syst&egrave;mes WindowsNT, on l'obtient par <strong class="userinput"><code> &#9674;^Suppr</code></strong> (contr&ocirc;le+alt.+suppr.).</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="exploitation.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="exploitation.html">Niveau sup&eacute;rieur</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="utilisateur.html">Suivant</a></td></tr><tr><td width="40%" align="left" valign="top">Chapitre&nbsp;5.&nbsp;Exploitation&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td><td width="40%" align="right" valign="top">&nbsp;3.&nbsp;Gestion des utilisateurs</td></tr></table></div></body></html>