<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>2.&nbsp;Les &eacute;l&eacute;ments centraux usuels</title><link rel="stylesheet" type="text/css" href="html.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="&Eacute;l&eacute;ments d'informatique"><link rel="up" href="ordinateur.html" title="Chapitre&nbsp;4.&nbsp;Structure d'un ordinateur"><link rel="prev" href="ordinateur.html" title="Chapitre&nbsp;4.&nbsp;Structure d'un ordinateur"><link rel="next" href="peripheriques.html" title="3.&nbsp;Les p&eacute;riph&eacute;riques usuels"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">2.&nbsp;Les &eacute;l&eacute;ments centraux usuels</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="ordinateur.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><th width="60%" align="center">Chapitre&nbsp;4.&nbsp;Structure d'un ordinateur</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="peripheriques.html">Suivant</a></td></tr></table><hr></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="unite-centrale"></a>2.&nbsp;Les &eacute;l&eacute;ments centraux usuels</h2></div></div></div><p>L'<span class="emphasis"><em>alimentation &eacute;lectrique</em></span><a class="indexterm" name="d0e1652"></a>. Elle est parfois compl&eacute;t&eacute;e ou remplac&eacute;e par une batterie, pour un portable, ou un onduleur, pour une machine fixe. Un onduleur est essentiellement une batterie externe. Les serveurs (ou les grappes de serveurs) sont souvent dot&eacute;s deux alimentations, pour limiter les risques en cas de d&eacute;faillance.</p><p>La <span class="emphasis"><em>carte m&egrave;re</em></span><a class="indexterm" name="d0e1660"></a> est un circuit imprim&eacute; sur lequel sont soud&eacute;s ou enfich&eacute;s les divers composants de l&#8217;unit&eacute; centrale. Elle est munie de certains connecteurs r&eacute;serv&eacute;s (socket ou slot pour le processeur, bus AGP pour les cartes graphiques, connecteurs sp&eacute;ciaux pour les lecteurs de disques...) et de connecteurs g&eacute;n&eacute;riques pour les cartes de p&eacute;riph&eacute;riques&nbsp;: ISA (vieille norme PC), NuBus (vieille norme Mac), PCI... Les cartes connect&eacute;es &agrave; la carte m&egrave;re sont appel&eacute;es <span class="emphasis"><em>cartes filles</em></span>.</p><p>La <span class="emphasis"><em>m&eacute;moire centrale</em></span>, compos&eacute;e de RAM<a class="indexterm" name="d0e1672"></a> (<span class="foreignphrase"><em class="foreignphrase">random access memory</em></span>&nbsp;: m&eacute;moire &agrave; acc&egrave;s al&eacute;atoire) ou <span class="emphasis"><em>m&eacute;moire vive</em></span> et de ROM (<span class="emphasis"><em>read only memory</em></span>&nbsp;: m&eacute;moire en lecture seulement, cette formulation n'est, en fait, plus appropri&eacute;e) ou <span class="emphasis"><em>m&eacute;moire morte</em></span>. La m&eacute;moire vive sert &agrave; stocker l'information en cours de traitement. La m&eacute;moire morte contient des programmes qui permettent de d&eacute;finir la configuration permanente de l'ordinateur (<span class="foreignphrase"><em class="foreignphrase">setup</em></span>, la configuration &eacute;tant stock&eacute;e dans une m&eacute;moire particuli&egrave;re appel&eacute;e CMOS) et qui permettent de d&eacute;marrer l'ordinateur, charger le syst&egrave;me d'exploitation et g&eacute;rer les fonctionnalit&eacute;s de base de l'infrastructure mat&eacute;rielle (BIOS). Les deux types de m&eacute;moire ont un fonctionnement similaire&nbsp;: lire et &eacute;crire dans des cases (g&eacute;n&eacute;ralement de 4 ou 8 octets) rep&eacute;r&eacute;es chacune par une adresse (g&eacute;n&eacute;ralement de 32 ou 64 bits). Les RAM sont g&eacute;n&eacute;ralement des m&eacute;moires tr&egrave;s rapides mais qui perdent leurs donn&eacute;es quand elles ne sont plus aliment&eacute;es &eacute;lectriquement. Les m&eacute;moirees mortes ne sont souvent plus aujourd'hui r&eacute;ellement des ROM&nbsp;: ce sont souvent des m&eacute;moires "flash" similaires &agrave; celles des cl&eacute;s USB et cartes m&eacute;moire.</p><p>Le ou les <a class="indexterm" name="d0e1693"></a><span class="emphasis"><em>processeurs centraux</em></span> (ou CPU&nbsp;: <span class="foreignphrase"><em class="foreignphrase">cental processing unit</em></span>), qui effectuent les traitements principaux de l'information. Aujourd'hui la plupart des ordinateurs personnels comportent plusieurs processeurs regroup&eacute;s sur la m&ecirc;me puce. Les ordinateurs comportent g&eacute;n&eacute;ralement plusieurs processeurs secondaires&nbsp;: processeur graphique, contr&ocirc;leur de disque etc.&nbsp;; ceux-ci sont consid&eacute;r&eacute;s comme p&eacute;riph&eacute;riques. La notion de "puissance" d'un processeur n'a <span class="emphasis"><em>aucun sens</em></span> dans l'absolu. On peut au mieux compter la fr&eacute;quence de l'horloge qui cadence ses travaux (en GHz, gigahertz), mais cette quantit&eacute; n'a de signification qu'&agrave; l'int&eacute;rieur d'une famille de processeurs donn&eacute;e.</p><div class="figure"><a name="d0e1705"></a><p class="title"><b>Figure&nbsp;4.2.&nbsp;Le mythique Z80 (une des nombreuses version) (DR)</b></p><div class="figure-contents"><div class="mediaobject"><img src="resources/z80-s.jpg" alt="Le mythique Z80 (une des nombreuses version) (DR)"></div></div></div><br class="figure-break"><p>Pour acc&eacute;l&eacute;rer l'acc&egrave;s des processeurs aux donn&eacute;es en m&eacute;moire, les ordinateurs sont souvent dot&eacute;s de syst&egrave;mes de <span class="emphasis"><em>m&eacute;moire cache</em></span><a class="indexterm" name="d0e1715"></a>. Ce syst&egrave;me est compos&eacute; de deux &agrave; trois niveaux de cache de taille croissante et de vitesse d&eacute;croissante. Le cache de niveau&nbsp;1 (L1), int&eacute;gr&eacute; au processeur, est tr&egrave;s rapide mais peu volumineux (pour des raisons de co&ucirc;t), celui de niveau&nbsp;2 (L2), plus lent est dans le processeur ou sur la carte m&egrave;re. Quand il y en a un, le cache de niveau&nbsp;3 est sur la carte m&egrave;re.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="ordinateur.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="ordinateur.html">Niveau sup&eacute;rieur</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="peripheriques.html">Suivant</a></td></tr><tr><td width="40%" align="left" valign="top">Chapitre&nbsp;4.&nbsp;Structure d'un ordinateur&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td><td width="40%" align="right" valign="top">&nbsp;3.&nbsp;Les p&eacute;riph&eacute;riques usuels</td></tr></table></div></body></html>