<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>3.&nbsp;L'architecture de von Neumann</title><link rel="stylesheet" type="text/css" href="html.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="&Eacute;l&eacute;ments d'informatique"><link rel="up" href="information.html" title="Chapitre&nbsp;1.&nbsp;&Eacute;l&eacute;ments de th&eacute;orie de l'information"><link rel="prev" href="turing.html" title="2.&nbsp;Le calcul selon Turing"><link rel="next" href="quantite-information.html" title="4.&nbsp;Quantit&eacute; d'information"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">3.&nbsp;L'architecture de von Neumann</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="turing.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><th width="60%" align="center">Chapitre&nbsp;1.&nbsp;&Eacute;l&eacute;ments de th&eacute;orie de l'information</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="quantite-information.html">Suivant</a></td></tr></table><hr></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="von_neumann"></a>3.&nbsp;L'architecture de von Neumann</h2></div></div></div><p>La plupart des mod&egrave;les de calcul s&eacute;parent de cette fa&ccedil;on les programmes des donn&eacute;es. Le principe de l'<span class="emphasis"><em>architecture de von Neumann</em></span><a class="indexterm" name="d0e180"></a> est qu'il n'existe pas de s&eacute;paration tranch&eacute;e entre programmes et donn&eacute;es. Le point fondamental est que ni les donn&eacute;es ni les programmes ne sont des objets r&eacute;els, pas plus que des id&eacute;es. Ils ne sont que des <span class="emphasis"><em>repr&eacute;sentations cod&eacute;es</em></span> de ceux-ci. On parle donc plut&ocirc;t d'information&nbsp;: l'information est un codage, d'objets, d'id&eacute;es, de proc&eacute;dures, d'algorithmes, etc.</p><p>Exemple&nbsp;: un son est une suite de variations de pression de l'air. Repr&eacute;senter des sons sous forme d'information (pour en faire un fichier son) c'est une mani&egrave;re de coder ces variations. Dans le cas d'esp&egrave;ce on commence par &eacute;chantillonner le niveau de pression au cours du temps. Ensuite, il s'agit de coder, pour chaque "tranche" de temps, l'amplitude de pression&nbsp;: on prend g&eacute;n&eacute;ralement la valeur de cette pression sur un intervale donn&eacute; avec une r&eacute;solution (nombre de valeurs possibles) donn&eacute;e. Les nombres obtenus doivent &ecirc;tre ensuite cod&eacute;s par des valeurs possibles de la m&eacute;moire. Chaque &eacute;tape de codage est d&eacute;finie par des choix. Par exemple, on n'est pas oblig&eacute; de repr&eacute;senter des amplitudes proches par des codes-m&eacute;moires proches&nbsp;: on choisit parfois des valeurs &eacute;loign&eacute;es pour parer &agrave; certains d&eacute;fauts de transmission. Par ailleurs la m&eacute;thode de codage des sons que nous venons de pr&eacute;senter est extr&ecirc;ment rudimentaire, les codages r&eacute;els sont souvent beaucoup plus complexes, de fa&ccedil;on &agrave; r&eacute;duire la taille des fichiers gr&acirc;ce &agrave; la compression et &agrave; l'abandon d'information inutiles.</p><p>Le second point important &agrave; se repr&eacute;senter est que l'on peut passer sans solution de continuit&eacute; de la notion de programme &agrave; celle de donn&eacute;es. Un programme qui, dans un langage donn&eacute;, sert &agrave; produire le texte &laquo;&nbsp;Bonjour tout le monde&nbsp;!&nbsp;&raquo; n'est-il pas, en effet, une forme de codage de ce texte&nbsp;? C'est d'ailleurs cette id&eacute;e qui est &agrave; la base des principaux algorithmes de compression de donn&eacute;es (sans perte)&nbsp;: un fichier compress&eacute; n'est finalement qu'une fa&ccedil;on de programme permettant de produire les donn&eacute;es non compress&eacute;es. &Agrave; l'inverse un document de nature essentiellement textuelle peut contenir des &eacute;l&eacute;ments programm&eacute;s&nbsp;: "macros" pour les traitement texte, scripts int&eacute;gr&eacute;s pour une page <span class="foreignphrase"><em class="foreignphrase">web</em></span> etc. Finalement, tout programme peut &ecirc;tre vu comme une donn&eacute;e et toute donn&eacute;e comme une forme de programme (sur un mode tr&egrave;s similaire &agrave; la dualit&eacute; onde-corpuscule en M&eacute;canique Quantique).</p><p>Dans les ordinateurs modernes l'information, quelle qu'elle soit, est donc stock&eacute;e dans les m&ecirc;mes <span class="emphasis"><em>m&eacute;moires</em></span>, dont nous d&eacute;taillons les types plus loin. Ces m&eacute;moires sont compos&eacute;es de cases, susceptibles d'accueillir un <span class="emphasis"><em>contenu</em></span> et d&eacute;sign&eacute;es par des adresses. Si l'on ne retient d'un ordinateur que "son" processeur et "sa" m&eacute;moire, on retrouve un sch&eacute;ma assez proche des machines de Turing th&eacute;oriques.</p></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="turing.html">Pr&eacute;c&eacute;dent</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="information.html">Niveau sup&eacute;rieur</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="quantite-information.html">Suivant</a></td></tr><tr><td width="40%" align="left" valign="top">2.&nbsp;Le calcul selon Turing&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">Sommaire</a></td><td width="40%" align="right" valign="top">&nbsp;4.&nbsp;Quantit&eacute; d'information</td></tr></table></div></body></html>